NordicPlayground/nrf52-ble-image-transfer-demo/main.c
    myCamera.open();
    myCamera.setResolution(OV2640_320x240);
    
    for(int i = 0; i < TEST_FILE_SIZE; i++)
    {
        test_file[i] = (i + 32) % 256;
    }
    
    for(int i = 0; i < IMAGE_MAX_SIZE; i++) jpg_buf[i] = 0xCC;
    
    // Enter main loop.
    for (;;)
    {
        //power_manage();
        if(button1.isPressed() || m_new_command_received == 1)
        {
            uint32_t image_size;
            m_new_command_received = 0;
            //ble_its_send_file(&m_nus, test_file, TEST_FILE_SIZE);
            printf("Starting capture...\r\n");
            myCamera.startSingleCapture();
            image_size = myCamera.bytesAvailable();
            printf("Capture complete: size %i bytes\r\n", (int)(image_size));
            
            if(myCamera.fillBuffer(jpg_buf, IMAGE_MAX_SIZE) < IMAGE_MAX_SIZE)
            {
                printf("Readout finished!\r\n");
                ble_its_send_file(&m_nus, jpg_buf + 1, image_size - 1, m_ble_nus_max_data_len);
            }
        }
        if(m_new_command_received == 3)
        {
            m_new_command_received = 0;
            
            printf("Change resolution to mode: %i\r\n", (int)m_new_resolution);
            switch(m_new_resolution)
            {
                case 0:
                    myCamera.setResolution(OV2640_160x120);
                    break;
                
                case 1:
                    myCamera.setResolution(OV2640_320x240);
                    break;

                case 2:
                    myCamera.setResolution(OV2640_640x480);
                    break;

                case 3:
                    myCamera.setResolution(OV2640_800x600);
                    break;

                case 4:
                    myCamera.setResolution(OV2640_1024x768);
                    break;
                
                case 5:
                    myCamera.setResolution(OV2640_1600x1200);
                    break;
                
            }
        }
    }
}


/**
 * @}
 */
